:PROPERTIES:
:ID:       c8fcfc53-6d2a-4b9c-a836-c303933b6563
:END:
#+language: en
#+EXPORT_FILE_NAME: ./podcast_automation.md

#+CALL: ../../lp.org:check-result()

#+name: init
#+BEGIN_SRC bash :results none :exports none :session c8fcfc53-6d2a-4b9c-a836-c303933b6563
  . ./sandboxing.sh
#+END_SRC

When listening to podcast, I like to download some episode up front.

#+NAME: download_body
#+BEGIN_SRC python :results none :exports code
@podcast.command()
@option('--number', type=int, default=10, help='How many episodes to download at once')
def download(number):
    'Downloading podcasts'
    print(f'Downloading {number} episodes')
#+END_SRC

#+NAME: download
#+BEGIN_SRC bash :results none :exports none :session c8fcfc53-6d2a-4b9c-a836-c303933b6563 :noweb yes
clk command create python podcast --group --force --description "Dealing with podcasts" --body "
<<download_body>>
"
#+END_SRC

#+NAME: tryit
#+BEGIN_SRC bash :results verbatim :exports both :session c8fcfc53-6d2a-4b9c-a836-c303933b6563 :cache yes
clk podcast download
#+END_SRC

#+RESULTS[9e5e1cc779f8de092e883043b56d2327a255009c]: tryit
: Downloading 10 episodes

Now, I want this command to be wrapped into an alias to ease making it part of
more complicated flows. I want to control the number of podcast to download
using an environment variable, hence the use of the 'tpl:' pattern appears
appropriate.

#+NAME: makeitalias
#+BEGIN_SRC bash :results verbatim :exports both :session c8fcfc53-6d2a-4b9c-a836-c303933b6563 :cache yes
clk alias set podcast.dwim echo 'Would do something before' , podcast download --number 'noeval:tpl:{NUMBER_TO_DOWNLOAD}' , echo 'would do something after'
#+END_SRC

#+RESULTS[878bae04a233b829b08b4b6deaa8bbec63a73d61]: makeitalias
: New global alias for podcast.dwim: echo 'Would do something before' , podcast download --number 'tpl:{NUMBER_TO_DOWNLOAD}' , echo 'would do something after'

Then I can call it with:

#+NAME: callit
#+BEGIN_SRC bash :results verbatim :exports both :session c8fcfc53-6d2a-4b9c-a836-c303933b6563 :cache yes
export NUMBER_TO_DOWNLOAD=100
clk podcast dwim
#+END_SRC

#+RESULTS[c0212f3e26f682e0699a082e7dcf612ef0794f12]: callit
: Would do something before
: Downloading 100 episodes
: would do something after

Note that it needs the environment variable to be set, or it will raise an
error.

* filtering by directory
  :PROPERTIES:
  :CUSTOM_ID: filtering-by-directory
  :END:

As my podcast collection grows, I organize episodes into directories: music,
stories, news, etc. I want to add a ~--directory~ option to the podcast group so
I can filter which directories to work with.

#+NAME: podcast_with_directory_body
#+BEGIN_SRC python :results none :exports code
@group()
@option('--directory', '-d', multiple=True, help='Only work with these directories')
def podcast(directory):
    'Dealing with podcasts'
    if directory:
        print(f'Filtering to directories: {', '.join(directory)}')
#+END_SRC

#+NAME: podcast_with_directory
#+BEGIN_SRC bash :results none :exports none :session c8fcfc53-6d2a-4b9c-a836-c303933b6563 :noweb yes
clk command create python podcast --group --force --description "Dealing with podcasts" --body "
<<podcast_with_directory_body>>

<<download_body>>
"
#+END_SRC

Now I can filter downloads to specific directories:

#+NAME: download_filtered
#+BEGIN_SRC bash :results verbatim :exports both :session c8fcfc53-6d2a-4b9c-a836-c303933b6563 :cache yes
clk podcast --directory music download
#+END_SRC

#+RESULTS[32c14d5399fb13e3c565cd246ec764782be2e08d]: download_filtered
: Filtering to directories: music
: Downloading 10 episodes

I frequently work with my music podcasts, so I create an alias to save typing:

#+NAME: music_alias
#+BEGIN_SRC bash :results verbatim :exports both :session c8fcfc53-6d2a-4b9c-a836-c303933b6563 :cache yes
clk alias set podcast.music podcast --directory music download
#+END_SRC

#+RESULTS[151779b6a57982cc8048f4540baede86e36c4a1e]: music_alias
: New global alias for podcast.music: podcast --directory music download

Now ~clk podcast music~ is a shortcut for downloading music podcasts:

#+NAME: use_music_alias
#+BEGIN_SRC bash :results verbatim :exports both :session c8fcfc53-6d2a-4b9c-a836-c303933b6563 :cache yes
clk podcast music
#+END_SRC

#+RESULTS[ecfba83919f256bb037f9b039ee23eed861a537c]: use_music_alias
: Filtering to directories: music
: Downloading 10 episodes

The ~--directory music~ option from the alias is correctly passed to the podcast
group, and the download command runs as expected.

I can also create an alias that filters multiple directories at once. For
instance, I want a shortcut for all my audio entertainment (music and songs):

#+NAME: audio_alias
#+BEGIN_SRC bash :results verbatim :exports both :session c8fcfc53-6d2a-4b9c-a836-c303933b6563 :cache yes
clk alias set podcast.audio podcast --directory music --directory song download
#+END_SRC

#+RESULTS[465bbbb90e91bd532c919fda633372f18db53bee]: audio_alias
: New global alias for podcast.audio: podcast --directory music --directory song download

Now ~clk podcast audio~ downloads from both directories:

#+NAME: use_audio_alias
#+BEGIN_SRC bash :results verbatim :exports both :session c8fcfc53-6d2a-4b9c-a836-c303933b6563 :cache yes
clk podcast audio
#+END_SRC

#+RESULTS[36c6d9b3602151e03c84c2993dcc380484c2dab3]: use_audio_alias
: Filtering to directories: music, song
: Downloading 10 episodes

Both directory options are passed correctly to the podcast group.

* discovering all podcast commands at a glance
  :PROPERTIES:
  :CUSTOM_ID: getting-help-on-groups-with-aliases
  :END:

Now that we have several ways to download podcasts—the base ~download~ command
plus specialized shortcuts like ~music~ and ~audio~—it's helpful to see them all
in one place. Running ~--help~ on the podcast group shows the complete picture.

#+NAME: group_help_with_alias
#+BEGIN_SRC bash :results verbatim :exports both :session c8fcfc53-6d2a-4b9c-a836-c303933b6563 :cache yes
clk podcast --help
#+END_SRC

#+RESULTS[42da70335c90e76d4afe7c525571573ac1577d77]: group_help_with_alias
#+begin_example
Usage: clk podcast [OPTIONS] COMMAND [ARGS]...

  Dealing with podcasts

  Edit this custom command by running `clk command edit podcast`
  Or edit ./clk-root/python/podcast.py directly.

Options:
  -d, --directory TEXT  Only work with these directories
  --help-all            Show the full help message, automatic options included.
  --help                Show this message and exit.

Commands:
  audio     Alias for: podcast --directory music --directory song download
  download  Downloading podcasts
  dwim      Alias for: echo 'Would do something before' , podcast download --number 'tpl:{NUMBER_TO_DOWNLOAD}' , echo
            'would do something after'
  music     Alias for: podcast --directory music download
#+end_example

This gives us a quick overview of all our podcast-related commands: the core
~download~ command and the shortcuts we created (~audio~, ~music~, ~dwim~). Each
alias shows a brief description of what it does, making it easy to remember
which shortcut to use for different podcast categories.

#+NAME: run
#+BEGIN_SRC bash :results none :exports none :tangle ../../tests/use_cases/podcast_automation.sh :noweb yes :shebang "#!/bin/bash -eu"
<<init>>

<<download>>

check-result(tryit)

check-result(makeitalias)

check-result(callit)

<<podcast_with_directory>>

check-result(download_filtered)

check-result(music_alias)

check-result(use_music_alias)

check-result(audio_alias)

check-result(use_audio_alias)

check-result(group_help_with_alias)
#+END_SRC
